alefragnani.project-manager
catppuccin.catppuccin-vsc
charliermarsh.ruff
donjayamanne.githistory
dracula-theme.theme-dracula
drcika.apc-extension
gruntfuggly.todo-tree
kevinrose.vsc-python-indent
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-vscode.live-server
ninoseki.vscode-pylens
njpwerner.autodocstring
oderwat.indent-rainbow
pomdtr.excalidraw-editor
ryanluker.vscode-coverage-gutters
tal7aouy.icons
tamasfe.even-better-toml
thang-nm.catppuccin-perfect-icons
timonwong.shellcheck
usernamehw.errorlens
